tostmann/esp-coordinator/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_NCP_BUS_MODE_USB=y
CONFIG_ZB_ENABLED=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=10
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# BUILD-2 — console routing (intentional self-override; do NOT "simplify").
# These four lines disable every console; the block further down then re-enables
# UART0 as the primary console (CONFIG_ESP_CONSOLE_UART_DEFAULT). defconfig is
# "last value wins", so the effective config is: primary console = UART0,
# secondary console = NONE. The load-bearing line here is
# CONFIG_ESP_CONSOLE_SECONDARY_NONE=y — it keeps the USB-Serial/JTAG OFF the
# console so it stays exclusively the NCP transport; never drop it. Output is
# silent anyway because CONFIG_LOG_DEFAULT_LEVEL_NONE is set above, so logs can
# never corrupt the frame stream even on UART0.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_UART_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_CONSOLE_UART_NONE=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_CONSOLE_NONE=n
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_BOOTLOADER_CONSOLE_UART_DEFAULT=y
# wifi-coex variant (branch wifi-coex): WiFi STA + 802.15.4 coexistence on the
# shared C6 2.4 GHz radio (Mode B). These are IDF auto-defaults on C6 but are
# pinned here so a clean build keeps them. Console routing above is unchanged —
# in Mode A the USB-Serial/JTAG carries Improv (not console); in Mode B it is
# idle and the NCP runs over TCP.
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_LWIP_SO_REUSE=y
